RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/aon_reg.h
struct aon_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[2048];

    /* 0x800 : aon */
    union {
        struct {
            uint32_t aon_resv              : 8; /* [ 7: 0],        r/w,        0xf */
            uint32_t reserved_8_11         : 4; /* [11: 8],       rsvd,        0x0 */
            uint32_t pu_aon_dc_tbuf        : 1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_19        : 7; /* [19:13],       rsvd,        0x0 */
            uint32_t ldo11_rt_pulldown     : 1; /* [   20],        r/w,        0x0 */
            uint32_t ldo11_rt_pulldown_sel : 1; /* [   21],        r/w,        0x0 */
            uint32_t sw_pu_ldo11_rt        : 1; /* [   22],        r/w,        0x1 */
            uint32_t reserved_23_31        : 9; /* [31:23],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } aon;

    /* 0x804 : aon_common */
    union {
        struct {
            uint32_t tmux_aon              : 3;  /* [ 2: 0],        r/w,        0x0 */
            uint32_t pmip_dc_tp_out_en_aon : 1;  /* [    3],        r/w,        0x0 */
            uint32_t ten_bg_sys_aon        : 1;  /* [    4],        r/w,        0x0 */
            uint32_t ten_dcdc11_0_aon      : 1;  /* [    5],        r/w,        0x0 */
            uint32_t ten_dcdc11_1_aon      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t ten_dcdc18_0_aon      : 1;  /* [    7],        r/w,        0x0 */
            uint32_t ten_dcdc18_1_aon      : 1;  /* [    8],        r/w,        0x0 */
            uint32_t ten_ldo12uhs          : 1;  /* [    9],        r/w,        0x0 */
            uint32_t ten_ldo18flash        : 1;  /* [   10],        r/w,        0x0 */
            uint32_t ten_ldo15cis          : 1;  /* [   11],        r/w,        0x0 */
            uint32_t ten_ldo18io_aon       : 1;  /* [   12],        r/w,        0x0 */
            uint32_t ten_ldo28cis          : 1;  /* [   13],        r/w,        0x0 */
            uint32_t ten_rc32m             : 1;  /* [   14],        r/w,        0x0 */
            uint32_t reserved_15           : 1;  /* [   15],       rsvd,        0x0 */
            uint32_t ten_ldo15rf_aon       : 1;  /* [   16],        r/w,        0x0 */
            uint32_t ten_xtal_aon          : 1;  /* [   17],        r/w,        0x0 */
            uint32_t dten_xtal_aon         : 1;  /* [   18],        r/w,        0x0 */
            uint32_t ten_mbg_aon           : 1;  /* [   19],        r/w,        0x0 */
            uint32_t ten_cip_misc_aon      : 1;  /* [   20],        r/w,        0x0 */
            uint32_t ten_aon               : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_31        : 10; /* [31:22],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } aon_common;

    /* 0x808 : aon_misc */
    union {
        struct {
            uint32_t sw_soc_en_aon : 1;  /* [    0],        r/w,        0x1 */
            uint32_t sw_wb_en_aon  : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_31 : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } aon_misc;

    /* 0x80c  reserved */
    uint8_t RESERVED0x80c[4];

    /* 0x810 : bg_sys_top */
    union {
        struct {
            uint32_t pu_bg_sys_aon   : 1;  /* [    0],        r/w,        0x1 */
            uint32_t istart_ctrl_aon : 1;  /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_31   : 30; /* [31: 2],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } bg_sys_top;

    /* 0x814 : dcdc_top_0 */
    union {
        struct {
            uint32_t dcdc11_sstart_time_aon  : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_3            : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t dcdc11_stby_lp_cur_aon  : 3; /* [ 6: 4],        r/w,        0x2 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t dcdc11_vc_clamp_vth_aon : 3; /* [10: 8],        r/w,        0x4 */
            uint32_t dcdc11_vout_sel_aon     : 5; /* [15:11],        r/w,        0x8 */
            uint32_t dcdc11_vout_trim_aon    : 4; /* [19:16],        r/w,        0x7 */
            uint32_t dcdc11_vpfm_aon         : 4; /* [23:20],        r/w,        0x4 */
            uint32_t dcdc11_zvs_td_opt_aon   : 3; /* [26:24],        r/w,        0x4 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t dcdc11_vstby_aon        : 2; /* [29:28],        r/w,        0x1 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dcdc_top_0;

    /* 0x818 : dcdc_top_1 */
    union {
        struct {
            uint32_t dcdc11_nonoverlap_td_aon  : 5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t dcdc11_ocp_out_aon        : 1; /* [    5],          r,        0x0 */
            uint32_t dcdc11_ocp_rst_aon        : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7                : 1; /* [    7],       rsvd,        0x0 */
            uint32_t dcdc11_ocp_vth_aon        : 3; /* [10: 8],        r/w,        0x4 */
            uint32_t dcdc11_osc_2m_mode_aon    : 1; /* [   11],        r/w,        0x0 */
            uint32_t dcdc11_osc_freq_trim_aon  : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dcdc11_pulldown_aon       : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19            : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t dcdc11_rc_sel_aon         : 4; /* [23:20],        r/w,        0x8 */
            uint32_t dcdc11_rdy_aon            : 1; /* [   24],          r,        0x0 */
            uint32_t reserved_25               : 1; /* [   25],       rsvd,        0x0 */
            uint32_t dcdc11_slope_curr_sel_aon : 5; /* [30:26],        r/w,        0x6 */
            uint32_t reserved_31               : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dcdc_top_1;

