RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/aon_reg.h
    /* 0x81C : ldo11soc_and_dctest */
    union {
        struct {
            uint32_t reserved_0_3                 : 4; /* [ 3: 0],       rsvd,        0x0 */
            uint32_t dcdc11_cfb_sel_aon           : 4; /* [ 7: 4],        r/w,        0x8 */
            uint32_t dcdc11_chf_sel_aon           : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dcdc11_comp_gm_sel_aon       : 3; /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15                  : 1; /* [   15],       rsvd,        0x0 */
            uint32_t dcdc11_cs_delay_aon          : 3; /* [18:16],        r/w,        0x4 */
            uint32_t reserved_19                  : 1; /* [   19],       rsvd,        0x0 */
            uint32_t dcdc11_drv_sr_aon            : 2; /* [21:20],        r/w,        0x3 */
            uint32_t dcdc11_en_antiring_aon       : 1; /* [   22],        r/w,        0x1 */
            uint32_t dcdc11_en_osc_inhibit_t2_aon : 1; /* [   23],        r/w,        0x1 */
            uint32_t dcdc11_en_slow_osc_aon       : 1; /* [   24],        r/w,        0x0 */
            uint32_t dcdc11_en_stby_lp_aon        : 1; /* [   25],        r/w,        0x1 */
            uint32_t dcdc11_en_stop_osc_aon       : 1; /* [   26],        r/w,        0x1 */
            uint32_t dcdc11_force_en_cs_zvs_aon   : 1; /* [   27],        r/w,        0x0 */
            uint32_t dcdc11_isense_trim_aon       : 3; /* [30:28],        r/w,        0x4 */
            uint32_t reserved_31                  : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ldo11soc_and_dctest;

    /* 0x820 : move to 0x2000F000[23] */
    union {
        struct {
            uint32_t dcdc18_sstart_time_aon  : 2; /* [ 1: 0],        r/w,        0x0 */
            uint32_t reserved_2_3            : 2; /* [ 3: 2],       rsvd,        0x0 */
            uint32_t dcdc18_stby_lp_cur_aon  : 3; /* [ 6: 4],        r/w,        0x2 */
            uint32_t reserved_7              : 1; /* [    7],       rsvd,        0x0 */
            uint32_t dcdc18_vc_clamp_vth_aon : 3; /* [10: 8],        r/w,        0x4 */
            uint32_t dcdc18_vout_sel_aon     : 5; /* [15:11],        r/w,       0x1b */
            uint32_t dcdc18_vout_trim_aon    : 4; /* [19:16],        r/w,        0x7 */
            uint32_t dcdc18_vpfm_aon         : 4; /* [23:20],        r/w,        0x4 */
            uint32_t dcdc18_zvs_td_opt_aon   : 3; /* [26:24],        r/w,        0x4 */
            uint32_t reserved_27             : 1; /* [   27],       rsvd,        0x0 */
            uint32_t dcdc18_vstby_aon        : 2; /* [29:28],        r/w,        0x1 */
            uint32_t reserved_30_31          : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dcdc18_top_0;

    /* 0x824 : dcdc18_top_1 */
    union {
        struct {
            uint32_t dcdc18_nonoverlap_td_aon  : 5; /* [ 4: 0],        r/w,        0x0 */
            uint32_t dcdc18_ocp_out_aon        : 1; /* [    5],          r,        0x0 */
            uint32_t dcdc18_ocp_rst_aon        : 1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7                : 1; /* [    7],       rsvd,        0x0 */
            uint32_t dcdc18_ocp_vth_aon        : 3; /* [10: 8],        r/w,        0x4 */
            uint32_t dcdc18_osc_2m_mode_aon    : 1; /* [   11],        r/w,        0x0 */
            uint32_t dcdc18_osc_freq_trim_aon  : 4; /* [15:12],        r/w,        0x8 */
            uint32_t dcdc18_pulldown_aon       : 1; /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_19            : 3; /* [19:17],       rsvd,        0x0 */
            uint32_t dcdc18_rc_sel_aon         : 4; /* [23:20],        r/w,        0x8 */
            uint32_t dcdc18_rdy_aon            : 1; /* [   24],          r,        0x0 */
            uint32_t reserved_25               : 1; /* [   25],       rsvd,        0x0 */
            uint32_t dcdc18_slope_curr_sel_aon : 5; /* [30:26],        r/w,        0xa */
            uint32_t reserved_31               : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dcdc18_top_1;

    /* 0x828 : dcdc18_top_2 */
    union {
        struct {
            uint32_t reserved_0_3                 : 4; /* [ 3: 0],       rsvd,        0x0 */
            uint32_t dcdc18_cfb_sel_aon           : 4; /* [ 7: 4],        r/w,        0x8 */
            uint32_t dcdc18_chf_sel_aon           : 4; /* [11: 8],        r/w,        0x1 */
            uint32_t dcdc18_comp_gm_sel_aon       : 3; /* [14:12],        r/w,        0x4 */
            uint32_t reserved_15                  : 1; /* [   15],       rsvd,        0x0 */
            uint32_t dcdc18_cs_delay_aon          : 3; /* [18:16],        r/w,        0x4 */
            uint32_t reserved_19                  : 1; /* [   19],       rsvd,        0x0 */
            uint32_t dcdc18_drv_sr_aon            : 2; /* [21:20],        r/w,        0x3 */
            uint32_t dcdc18_en_antiring_aon       : 1; /* [   22],        r/w,        0x1 */
            uint32_t dcdc18_en_osc_inhibit_t2_aon : 1; /* [   23],        r/w,        0x0 */
            uint32_t dcdc18_en_slow_osc_aon       : 1; /* [   24],        r/w,        0x0 */
            uint32_t dcdc18_en_stby_lp_aon        : 1; /* [   25],        r/w,        0x1 */
            uint32_t dcdc18_en_stop_osc_aon       : 1; /* [   26],        r/w,        0x1 */
            uint32_t dcdc18_force_en_cs_zvs_aon   : 1; /* [   27],        r/w,        0x0 */
            uint32_t dcdc18_isense_trim_aon       : 3; /* [30:28],        r/w,        0x4 */
            uint32_t reserved_31                  : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } dcdc18_top_2;

    /* 0x82C : psw_irrcv */
    union {
        struct {
            uint32_t pu_psw_irrcv_aon      : 1;  /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_18         : 18; /* [18: 1],       rsvd,        0x0 */
            uint32_t usb20_rref_ext_en_aon : 1;  /* [   19],        r/w,        0x0 */
            uint32_t en_por33_aon          : 1;  /* [   20],        r/w,        0x0 */
            uint32_t usb20_rref_hiz_aon    : 1;  /* [   21],        r/w,        0x0 */
            uint32_t reserved_22_23        : 2;  /* [23:22],       rsvd,        0x0 */
            uint32_t usb20_rcal_code_aon   : 6;  /* [29:24],        r/w,       0x1a */
            uint32_t reserved_30_31        : 2;  /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } psw_irrcv;

    /* 0x830  reserved */
    uint8_t RESERVED0x830[80];

    /* 0x880 : rf_top_aon */
    union {
        struct {
            uint32_t pu_mbg_aon               : 1; /* [    0],        r/w,        0x1 */
            uint32_t pu_ldo15rf_aon           : 1; /* [    1],        r/w,        0x1 */
            uint32_t pu_sfreg_aon             : 1; /* [    2],        r/w,        0x1 */
            uint32_t reserved_3               : 1; /* [    3],       rsvd,        0x0 */
            uint32_t pu_xtal_buf_aon          : 1; /* [    4],        r/w,        0x1 */
            uint32_t pu_xtal_aon              : 1; /* [    5],        r/w,        0x1 */
            uint32_t reserved_6_7             : 2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t ldo15rf_sstart_sel_aon   : 1; /* [    8],        r/w,        0x1 */
            uint32_t ldo15rf_sstart_delay_aon : 2; /* [10: 9],        r/w,        0x0 */
            uint32_t reserved_11              : 1; /* [   11],       rsvd,        0x0 */
            uint32_t ldo15rf_pulldown_aon     : 1; /* [   12],        r/w,        0x0 */
            uint32_t ldo15rf_pulldown_sel_aon : 1; /* [   13],        r/w,        0x0 */
            uint32_t reserved_14_15           : 2; /* [15:14],       rsvd,        0x0 */
            uint32_t ldo15rf_vout_sel_aon     : 3; /* [18:16],        r/w,        0x2 */
            uint32_t reserved_19_23           : 5; /* [23:19],       rsvd,        0x0 */
            uint32_t ldo15rf_cc_aon           : 2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_27           : 2; /* [27:26],       rsvd,        0x0 */
            uint32_t ldo15rf_bypass_aon       : 1; /* [   28],        r/w,        0x0 */
            uint32_t reserved_29_31           : 3; /* [31:29],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } rf_top_aon;

