RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/aon_reg.h
    /* 0x884 : xtal_cfg */
    union {
        struct {
            uint32_t xtal_bk_aon            : 2; /* [ 1: 0],        r/w,        0x1 */
            uint32_t xtal_capcode_extra_aon : 1; /* [    2],        r/w,        0x0 */
            uint32_t xtal_ext_sel_aon       : 1; /* [    3],        r/w,        0x0 */
            uint32_t xtal_buf_en_aon        : 4; /* [ 7: 4],        r/w,        0xe */
            uint32_t xtal_buf_hp_aon        : 4; /* [11: 8],        r/w,        0x0 */
            uint32_t xtal_fast_startup_aon  : 1; /* [   12],        r/w,        0x1 */
            uint32_t xtal_sleep_aon         : 1; /* [   13],        r/w,        0x1 */
            uint32_t xtal_amp_ctrl_aon      : 2; /* [15:14],        r/w,        0x3 */
            uint32_t xtal_capcode_out_aon   : 6; /* [21:16],        r/w,       0x10 */
            uint32_t xtal_capcode_in_aon    : 6; /* [27:22],        r/w,       0x10 */
            uint32_t xtal_gm_boost_aon      : 2; /* [29:28],        r/w,        0x3 */
            uint32_t xtal_rdy_sel_aon       : 2; /* [31:30],        r/w,        0x2 */
        } BF;
        uint32_t WORD;
    } xtal_cfg;

    /* 0x888 : xtal_cfg2 */
    union {
        struct {
            uint32_t wifi_xtal_ldo33_bypass_aon       : 1;  /* [    0],        r/w,        0x0 */
            uint32_t wifi_xtal_ldo33_sel_aon          : 3;  /* [ 3: 1],        r/w,        0x0 */
            uint32_t wifi_xtal_ldo18_sel_aon          : 2;  /* [ 5: 4],        r/w,        0x1 */
            uint32_t wifi_xtal_ldo33_pu_aon           : 1;  /* [    6],        r/w,        0x1 */
            uint32_t wifi_xtal_ldo18_pu_aon           : 1;  /* [    7],        r/w,        0x1 */
            uint32_t reserved_8_9                     : 2;  /* [ 9: 8],       rsvd,        0x0 */
            uint32_t wifi_xtal_reserve                : 4;  /* [13:10],        r/w,        0x0 */
            uint32_t reserved_14_15                   : 2;  /* [15:14],       rsvd,        0x0 */
            uint32_t wifi_xtal_ldo18_short_filter_aon : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_29                   : 13; /* [29:17],       rsvd,        0x0 */
            uint32_t xtal_buf_drv_aon                 : 2;  /* [31:30],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } xtal_cfg2;

    /* 0x88C : xtal_cfg3 */
    union {
        struct {
            uint32_t reserved_0_11            : 12; /* [11: 0],       rsvd,        0x0 */
            uint32_t wifi_xtal_clk_inv_en_aon : 1;  /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_15           : 3;  /* [15:13],       rsvd,        0x0 */
            uint32_t wifi_xtal_cml_en_aon     : 1;  /* [   16],        r/w,        0x0 */
            uint32_t wifi_xtal_cml_r_sel_aon  : 2;  /* [18:17],        r/w,        0x1 */
            uint32_t reserved_19              : 1;  /* [   19],       rsvd,        0x0 */
            uint32_t wifi_xtal_clk_en_aon     : 1;  /* [   20],        r/w,        0x1 */
            uint32_t reserved_21_29           : 9;  /* [29:21],       rsvd,        0x0 */
            uint32_t wifi_xtal_buf_drv_aon    : 2;  /* [31:30],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } xtal_cfg3;

    /* 0x890 : tsen */
    union {
        struct {
            uint32_t tsen_refcode_corner  : 12; /* [11: 0],        r/w,      0x8ff */
            uint32_t reserved_12_15       : 4;  /* [15:12],       rsvd,        0x0 */
            uint32_t tsen_refcode_rfcal   : 12; /* [27:16],        r/w,      0x8ff */
            uint32_t xtal_rdy             : 1;  /* [   28],          r,        0x1 */
            uint32_t xtal_inn_cfg_en_aon  : 1;  /* [   29],        r/w,        0x1 */
            uint32_t xtal_rdy_int_sel_aon : 2;  /* [31:30],        r/w,        0x1 */
        } BF;
        uint32_t WORD;
    } tsen;

    /* 0x894  reserved */
    uint8_t RESERVED0x894[48];

    /* 0x8C4 : ldo18io */
    union {
        struct {
            uint32_t reserved_0               : 1; /* [    0],       rsvd,        0x0 */
            uint32_t ldo18io_bypass_iso_aon   : 1; /* [    1],        r/w,        0x0 */
            uint32_t ldo18io_pulldown_aon     : 1; /* [    2],        r/w,        0x0 */
            uint32_t ldo18io_pulldown_sel_aon : 1; /* [    3],        r/w,        0x1 */
            uint32_t ldo18io_bm_aon           : 3; /* [ 6: 4],        r/w,        0x3 */
            uint32_t reserved_7               : 1; /* [    7],       rsvd,        0x0 */
            uint32_t ldo18io_cc_aon           : 3; /* [10: 8],        r/w,        0x3 */
            uint32_t ldo18io_ocp_out_aon      : 1; /* [   11],          r,        0x0 */
            uint32_t ldo18io_ocp_th_aon       : 3; /* [14:12],        r/w,        0x3 */
            uint32_t ldo18io_ocp_en_aon       : 1; /* [   15],        r/w,        0x1 */
            uint32_t ldo18io_sstart_delay_aon : 3; /* [18:16],        r/w,        0x3 */
            uint32_t ldo18io_sstart_en_aon    : 1; /* [   19],        r/w,        0x1 */
            uint32_t ldo18io_vout_sel_aon     : 4; /* [23:20],        r/w,        0x5 */
            uint32_t ldo18io_vout_trim_aon    : 4; /* [27:24],        r/w,        0x7 */
            uint32_t reserved_28_31           : 4; /* [31:28],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } ldo18io;

    /* 0x8c8  reserved */
    uint8_t RESERVED0x8c8[56];

    /* 0x900 : acomp0_ctrl */
    union {
        struct {
            uint32_t acomp0_en        : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3     : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t acomp0_hyst_seln : 3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t acomp0_hyst_selp : 3; /* [ 9: 7],        r/w,        0x0 */
            uint32_t acomp0_bias_prog : 2; /* [11:10],        r/w,        0x0 */
            uint32_t acomp0_level_sel : 6; /* [17:12],        r/w,        0x0 */
            uint32_t acomp0_neg_sel   : 4; /* [21:18],        r/w,        0x0 */
            uint32_t acomp0_pos_sel   : 4; /* [25:22],        r/w,        0x0 */
            uint32_t acomp0_muxen     : 1; /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31   : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } acomp0_ctrl;

    /* 0x904 : acomp1_ctrl */
    union {
        struct {
            uint32_t acomp1_en        : 1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_3     : 3; /* [ 3: 1],       rsvd,        0x0 */
            uint32_t acomp1_hyst_seln : 3; /* [ 6: 4],        r/w,        0x0 */
            uint32_t acomp1_hyst_selp : 3; /* [ 9: 7],        r/w,        0x0 */
            uint32_t acomp1_bias_prog : 2; /* [11:10],        r/w,        0x0 */
            uint32_t acomp1_level_sel : 6; /* [17:12],        r/w,        0x0 */
            uint32_t acomp1_neg_sel   : 4; /* [21:18],        r/w,        0x0 */
            uint32_t acomp1_pos_sel   : 4; /* [25:22],        r/w,        0x0 */
            uint32_t acomp1_muxen     : 1; /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_31   : 5; /* [31:27],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } acomp1_ctrl;

    /* 0x908 : acomp_ctrl */
    union {
        struct {
            uint32_t acomp1_rstn_ana : 1; /* [    0],        r/w,        0x1 */
            uint32_t acomp0_rstn_ana : 1; /* [    1],        r/w,        0x1 */
            uint32_t reserved_2_7    : 6; /* [ 7: 2],       rsvd,        0x0 */
            uint32_t acomp1_test_en  : 1; /* [    8],        r/w,        0x0 */
            uint32_t acomp0_test_en  : 1; /* [    9],        r/w,        0x0 */
            uint32_t acomp1_test_sel : 2; /* [11:10],        r/w,        0x0 */
            uint32_t acomp0_test_sel : 2; /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_16  : 3; /* [16:14],       rsvd,        0x0 */
            uint32_t acomp1_out_raw  : 1; /* [   17],          r,        0x0 */
            uint32_t reserved_18     : 1; /* [   18],       rsvd,        0x0 */
            uint32_t acomp0_out_raw  : 1; /* [   19],          r,        0x0 */
            uint32_t reserved_20_23  : 4; /* [23:20],       rsvd,        0x0 */
            uint32_t acomp_vref_sel  : 6; /* [29:24],        r/w,        0x0 */
            uint32_t acomp_reserved  : 2; /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } acomp_ctrl;

    /* 0x90C : gpadc_reg_cmd */
    union {
        struct {
            uint32_t gpadc_global_en        : 1; /* [    0],        r/w,        0x0 */
            uint32_t gpadc_conv_start       : 1; /* [    1],        r/w,        0x0 */
            uint32_t gpadc_soft_rst         : 1; /* [    2],        r/w,        0x0 */
            uint32_t gpadc_neg_sel          : 5; /* [ 7: 3],        r/w,        0xf */
            uint32_t gpadc_pos_sel          : 5; /* [12: 8],        r/w,        0xf */
            uint32_t gpadc_neg_gnd          : 1; /* [   13],        r/w,        0x0 */
            uint32_t gpadc_micbias_en       : 1; /* [   14],        r/w,        0x0 */
            uint32_t gpadc_micpga_en        : 1; /* [   15],        r/w,        0x0 */
            uint32_t gpadc_byp_micboost     : 1; /* [   16],        r/w,        0x0 */
            uint32_t gpadc_rcal_en          : 1; /* [   17],        r/w,        0x0 */
            uint32_t gpadc_dwa_en           : 1; /* [   18],        r/w,        0x0 */
            uint32_t gpadc_mic2_diff        : 1; /* [   19],        r/w,        0x0 */
            uint32_t gpadc_mic1_diff        : 1; /* [   20],        r/w,        0x0 */
            uint32_t gpadc_mic_pga2_gain    : 2; /* [22:21],        r/w,        0x0 */
            uint32_t gpadc_micboost_32db_en : 1; /* [   23],        r/w,        0x0 */
            uint32_t reserved_24_26         : 3; /* [26:24],       rsvd,        0x0 */
            uint32_t gpadc_chip_sen_pu      : 1; /* [   27],        r/w,        0x0 */
            uint32_t gpadc_sen_sel          : 3; /* [30:28],        r/w,        0x0 */
            uint32_t gpadc_sen_test_en      : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_cmd;

    /* 0x910 : gpadc_reg_config1 */
    union {
        struct {
            uint32_t gpadc_cal_os_en      : 1; /* [    0],        r/w,        0x0 */
            uint32_t gpadc_cont_conv_en   : 1; /* [    1],        r/w,        0x1 */
            uint32_t gpadc_res_sel        : 3; /* [ 4: 2],        r/w,        0x0 */
            uint32_t reserved_5_7         : 3; /* [ 7: 5],       rsvd,        0x0 */
            uint32_t gpadc_vcm_sel_en     : 1; /* [    8],        r/w,        0x0 */
            uint32_t gpadc_vcm_hyst_sel   : 1; /* [    9],        r/w,        0x0 */
            uint32_t gpadc_lowv_det_en    : 1; /* [   10],        r/w,        0x0 */
            uint32_t gpadc_pwm_trg_en     : 1; /* [   11],        r/w,        0x0 */
            uint32_t gpadc_clk_ana_dly    : 4; /* [15:12],        r/w,        0x0 */
            uint32_t gpadc_clk_ana_dly_en : 1; /* [   16],        r/w,        0x0 */
            uint32_t gpadc_clk_ana_inv    : 1; /* [   17],        r/w,        0x0 */
            uint32_t gpadc_clk_div_ratio  : 3; /* [20:18],        r/w,        0x3 */
            uint32_t gpadc_scan_length    : 4; /* [24:21],        r/w,        0x0 */
            uint32_t gpadc_scan_en        : 1; /* [   25],        r/w,        0x0 */
            uint32_t gpadc_dither_en      : 1; /* [   26],        r/w,        0x0 */
            uint32_t gpadc_v11_sel        : 2; /* [28:27],        r/w,        0x0 */
            uint32_t gpadc_v18_sel        : 2; /* [30:29],        r/w,        0x0 */
            uint32_t reserved_31          : 1; /* [   31],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_config1;

    /* 0x914 : gpadc_reg_config2 */
    union {
        struct {
            uint32_t reserved_0_1      : 2; /* [ 1: 0],       rsvd,        0x0 */
            uint32_t gpadc_diff_mode   : 1; /* [    2],        r/w,        0x0 */
            uint32_t gpadc_vref_sel    : 1; /* [    3],        r/w,        0x0 */
            uint32_t gpadc_vbat_en     : 1; /* [    4],        r/w,        0x0 */
            uint32_t gpadc_tsext_sel   : 1; /* [    5],        r/w,        0x0 */
            uint32_t gpadc_ts_en       : 1; /* [    6],        r/w,        0x0 */
            uint32_t gpadc_pga_vcm     : 2; /* [ 8: 7],        r/w,        0x2 */
            uint32_t gpadc_pga_os_cal  : 4; /* [12: 9],        r/w,        0x8 */
            uint32_t gpadc_pga_en      : 1; /* [   13],        r/w,        0x0 */
            uint32_t gpadc_pga_vcmi_en : 1; /* [   14],        r/w,        0x0 */
            uint32_t gpadc_chop_mode   : 2; /* [16:15],        r/w,        0x3 */
            uint32_t gpadc_bias_sel    : 1; /* [   17],        r/w,        0x0 */
            uint32_t gpadc_test_en     : 1; /* [   18],        r/w,        0x0 */
            uint32_t gpadc_test_sel    : 3; /* [21:19],        r/w,        0x0 */
            uint32_t gpadc_pga2_gain   : 3; /* [24:22],        r/w,        0x0 */
            uint32_t gpadc_pga1_gain   : 3; /* [27:25],        r/w,        0x0 */
            uint32_t gpadc_dly_sel     : 3; /* [30:28],        r/w,        0x0 */
            uint32_t gpadc_tsvbe_low   : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_config2;

    /* 0x918 : adc converation sequence 1 */
    union {
        struct {
            uint32_t gpadc_scan_pos_0 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t gpadc_scan_pos_1 : 5; /* [ 9: 5],        r/w,        0xf */
            uint32_t gpadc_scan_pos_2 : 5; /* [14:10],        r/w,        0xf */
            uint32_t gpadc_scan_pos_3 : 5; /* [19:15],        r/w,        0xf */
            uint32_t gpadc_scan_pos_4 : 5; /* [24:20],        r/w,        0xf */
            uint32_t gpadc_scan_pos_5 : 5; /* [29:25],        r/w,        0xf */
            uint32_t reserved_30_31   : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_scn_pos1;

    /* 0x91C : adc converation sequence 2 */
    union {
        struct {
            uint32_t gpadc_scan_pos_6  : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t gpadc_scan_pos_7  : 5; /* [ 9: 5],        r/w,        0xf */
            uint32_t gpadc_scan_pos_8  : 5; /* [14:10],        r/w,        0xf */
            uint32_t gpadc_scan_pos_9  : 5; /* [19:15],        r/w,        0xf */
            uint32_t gpadc_scan_pos_10 : 5; /* [24:20],        r/w,        0xf */
            uint32_t gpadc_scan_pos_11 : 5; /* [29:25],        r/w,        0xf */
            uint32_t reserved_30_31    : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_scn_pos2;

    /* 0x920 : adc converation sequence 3 */
    union {
        struct {
            uint32_t gpadc_scan_neg_0 : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t gpadc_scan_neg_1 : 5; /* [ 9: 5],        r/w,        0xf */
            uint32_t gpadc_scan_neg_2 : 5; /* [14:10],        r/w,        0xf */
            uint32_t gpadc_scan_neg_3 : 5; /* [19:15],        r/w,        0xf */
            uint32_t gpadc_scan_neg_4 : 5; /* [24:20],        r/w,        0xf */
            uint32_t gpadc_scan_neg_5 : 5; /* [29:25],        r/w,        0xf */
            uint32_t reserved_30_31   : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_scn_neg1;

