RT-Thread/rt-thread/bsp/bouffalo_lab/libraries/bl_mcu_sdk/drivers/soc/bl808/std/include/hardware/aon_reg.h
    /* 0x924 : adc converation sequence 4 */
    union {
        struct {
            uint32_t gpadc_scan_neg_6  : 5; /* [ 4: 0],        r/w,        0xf */
            uint32_t gpadc_scan_neg_7  : 5; /* [ 9: 5],        r/w,        0xf */
            uint32_t gpadc_scan_neg_8  : 5; /* [14:10],        r/w,        0xf */
            uint32_t gpadc_scan_neg_9  : 5; /* [19:15],        r/w,        0xf */
            uint32_t gpadc_scan_neg_10 : 5; /* [24:20],        r/w,        0xf */
            uint32_t gpadc_scan_neg_11 : 5; /* [29:25],        r/w,        0xf */
            uint32_t reserved_30_31    : 2; /* [31:30],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_scn_neg2;

    /* 0x928 : gpadc_reg_status */
    union {
        struct {
            uint32_t gpadc_data_rdy : 1;  /* [    0],          r,        0x0 */
            uint32_t reserved_1_15  : 15; /* [15: 1],       rsvd,        0x0 */
            uint32_t gpadc_reserved : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_status;

    /* 0x92C : gpadc_reg_isr */
    union {
        struct {
            uint32_t gpadc_neg_satur      : 1;  /* [    0],          r,        0x0 */
            uint32_t gpadc_pos_satur      : 1;  /* [    1],          r,        0x0 */
            uint32_t reserved_2_3         : 2;  /* [ 3: 2],       rsvd,        0x0 */
            uint32_t gpadc_neg_satur_clr  : 1;  /* [    4],        r/w,        0x0 */
            uint32_t gpadc_pos_satur_clr  : 1;  /* [    5],        r/w,        0x0 */
            uint32_t reserved_6_7         : 2;  /* [ 7: 6],       rsvd,        0x0 */
            uint32_t gpadc_neg_satur_mask : 1;  /* [    8],        r/w,        0x0 */
            uint32_t gpadc_pos_satur_mask : 1;  /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_31       : 22; /* [31:10],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_isr;

    /* 0x930 : gpadc_reg_result */
    union {
        struct {
            uint32_t gpadc_data_out : 26; /* [25: 0],          r,  0x1ef0000 */
            uint32_t reserved_26_31 : 6;  /* [31:26],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_result;

    /* 0x934 : gpadc_reg_raw_result */
    union {
        struct {
            uint32_t gpadc_raw_data : 12; /* [11: 0],          r,        0x0 */
            uint32_t reserved_12_31 : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_raw_result;

    /* 0x938 : gpadc_reg_define */
    union {
        struct {
            uint32_t gpadc_os_cal_data : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31    : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } gpadc_reg_define;

    /* 0x93C : hbncore_resv0 */
    union {
        struct {
            uint32_t hbncore_resv0_data : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } hbncore_resv0;

    /* 0x940 : hbncore_resv1 */
    union {
        struct {
            uint32_t hbncore_resv1_data : 32; /* [31: 0],        r/w, 0xffffffff */
        } BF;
        uint32_t WORD;
    } hbncore_resv1;
};

typedef volatile struct aon_reg aon_reg_t;

#endif /* __AON_REG_H__ */
